## Loading Packages

In [14]:
import numpy as np
import pandas as pd
from pathlib import Path

DATA = Path.cwd().parent / "data"

## Loading Employees Data

In [ ]:
employees = pd.read_csv(DATA / "processed" / "all_remunerations.csv")

## Employee Name Inspection

### Duplicate Names

In [11]:
name_counts = employees[["name"]].value_counts()
name_counts[name_counts > 1]

name
Lee, Karen                 2
Martin, Tara               2
Gill, Parm                 2
Madden, John               2
Wong, Ken                  2
Wong, Kenneth              2
Black, Jennifer            2
Reid, Andrea               2
Macdonald, Christopher     2
Harvey, Laura              2
Ananthanarayana, Girish    2
Wilson, Brian              2
Wong, Helen                2
Johnson, James             2
Carroll, Michael           2
Moore, David               2
Wang, Fei                  2
Wong, Vincent              2
Liu, Jie                   2
Moss, Laura                2
Lee, Steven                2
Joseph, Paul               2
Ng, Yvonne                 2
Jones, David               2
Liu, Sandy                 2
Douglas, Jennifer          2
Tsang, Teresa              2
Lee, Michael               2
Name: count, dtype: int64

### Ambiguous Names

In [25]:
employees[~employees["ambiguous_name"].isnull()]

                      name  remuneration  expenses ambiguous_name
20             Abe, Masumi        101245    2447.0        Melania
21       Adem, Maria Luisa        102205     435.0        Melania
61           Agawa, Philip         84549       NaN           Jose
62      Alava Saltos, Juan         85803    2326.0           Jose
86             Algar, Russ        199153       NaN          Israr
...                    ...           ...       ...            ...
7256  Yue, Elizabeth Fong-         89316      93.0           Ning
7262           Yuen, David         80067    1082.0        Hossein
7263      Zarifi, Mohammad        124986    7548.0        Hossein
7271     Yuen, Macaire Man         89471     550.0          Saint
7272    Zawistowski, Jerzy        124936    1016.0          Saint

[323 rows x 4 columns]